// Practice Pat 1 ARRAY

//? QS:1 :তুই একটা অ্যারে বানালি, যেখানে 71 থেকে 79 পর্যন্ত সংখ্যাগুলো রাখ।
// Ans

const num = [71, 72, 73, 74, 75, 76, 78, 79];

//? QS:2 :তোর বাসায় একটা ছোট ফ্রিজ আছে, সেখানে ঠিক 5টা ফল রাখতে পারিস। তুই একটা অ্যারে বানিয়ে তাতে আপেল, কলা, কমলা, আম আর পেয়ারা রাখলি।
// Ans

const fortes = ['aple', 'banena', 'orenge', 'Mango'];

//? QS:3 :ধর, তুই একদিন বাজারে গিয়েছিলি। তোর ব্যাগে আছে, পেঁয়াজ, বেগুন, মুলা, গাজর, টমেটো, শশা আর পটল 10টা সবজি রাখলি। একটা প্রোগ্রাম লিখে বের কর, ব্যাগে মোট কতটা সবজি আছে।
// Ans
const Fortest2 = [
  'aple',
  'banena',
  'orenge',
  'Mango',
  34,
  43,
  34,
  45,
  65,
  65,
  343,
  3453,
  2344,
];
console.log(Fortest2.length);

//? QS:4 :তোর 5টা প্রিয় সিনেমার নাম একটা অ্যারেতে রাখ।
// Ans
const favMoveis = ['movise 1', '3', 32, 23, 23, 23];

//? QS:5 :একটা অ্যারে নিলি, যেখানে মধ্যে 11 থেকে 30-এর মধ্যে বিজোড় সংখ্যাগুলো থাকবে।
// Ans
const nunb = [11, 13, 15, 17, 19, 21, 23, 25, 27, 29];

//? QS:6 :তোর চারপাশে তাকিয়ে ৮টা জিনিস দেখতে পারছোস, সেগুলো একটা অ্যারে বাননা। তারপর সেই অ্যারের লেংথ কনসোলে লগ কর।
// Ans
const Watch = [12, 123, 234, 242, 523, 242, 2412, 2, 234, 3];

//? QS:7 :কোনো একটা দেশের রাজধানীর নাম নিয়ে সেটা অ্যারেতে রাখ এবং তার লেংথ কনসোলে লগ কর।
// Ans
const RajdhaniName = ['Bangladash: Dhaka'];
console.log(RajdhaniName);
