// Practice Pat 5 Loop

//? Qs:1 :তোমার কাজ হবে ২০ থেকে ৫০ পর্যন্ত যে সকল সংখ্যা ৭ দিয়ে বিভাজ্য, তা আউটপুট হিসেবে দেখাও।
// Ans:
for (let i = 20; i <= 50; i++) {
  if (i % 7 == 0) {
    console.log(`7 dara biabjo number is: ${i}`);
  }
}

//? Qs:2 :এবার ৪০ থেকে ৮০ পর্যন্ত যে সকল সংখ্যা ৫ দিয়ে এবং ৭ দিয়ে বিভাজ্য, তা আউটপুট হিসেবে দেখাও।
// Ans:
for (let i = 40; i <= 80; i++) {
  if (i % 7 == 0 && i % 5 == 0) {
    console.log(`7 dara biabjo number is: ${i}`);
  }
}

//? Qs:3 :এখন তোমার প্রোগ্রাম হলো ১ থেকে ৪০ পর্যন্ত যে সকল সংখ্যা ১৩ দিয়ে বিভাজ্য, তাদের যোগফল কর।
// Ans:
let sum = 0;
for (let i = 1; i <= 40; i++) {
  if (i % 13 == 0) {
    sum = sum + i;
  }
}
console.log(sum);

//? Qs:4 :For লুপ দিয়ে ১ থেকে ৫০ পর্যন্ত লুপ চালাও। তবে লুপ চালানোর সময় লুপ ভেরিয়েবলের মান প্রত্যেকবার ৪ করে বাড়াবে।
// Ans:
for (let i = 1; i <= 50; i = i + 4) {
  console.log(i);
}

//? Qs:5 :০ থেকে ১০০ পর্যন্ত সব সংখ্যাগুলো প্রিন্ট কর, যা ৯ এবং ৬ দিয়ে বিভাজ্য।
// Ans:
for (let i = 0; i < 100; i++) {
  if (i % 9 == 0 && i % 6 == 0) {
    console.log(i);
  }
}

//? Qs:5 : ১ থেকে ৫০ পর্যন্ত এমন সংখ্যাগুলো প্রিন্ট কর, যা ৩ এবং ৪ উভয়ের দ্বারা বিভাজ্য এবং সংখ্যাগুলোর যোগফল বের কর।
// Ans:
let sum1 = 0;
for (let i = 1; i <= 50; i++) {
  if (i % 3 == 0 && i % 4 == 0) {
    sum1 = sum1 + i;
  }
}
console.log(sum1);
