// Practice Pat 6 Loop

//? Qs:1 : ধর, তুমি 1 থেকে 30 পর্যন্ত সংখ্যা প্রিন্ট করতে চাও, কিন্তু তোমার ইচ্ছা হলো, 15-এর পরে প্রিন্ট করা বন্ধ হবে, থেমে যাবে।
// Ans:
for (let i = 0; i <= 30; i++) {
  if (i > 15) {
    break;
  }
  console.log(i);
}

//? Qs:2 :তুমি 1 থেকে 40 পর্যন্ত প্রিন্ট করতে চাও, কিন্তু এমনভাবে, যেমন 7 দিয়ে বিভাজ্য সংখ্যাগুলো বাদ যায়। যেমন- 7, 14, 21, ইত্যাদি বাদ যাবে। একটা প্রোগ্রাম লিখ, যেখানে এই সংখ্যাগুলো প্রিন্ট হবে।

// Ans:
for (let i = 1; i <= 40; i++) {
  if (i % 7 == 0) {
    continue;
  }
  console.log(i);
}

//? Qs:3 :তুমি 1 থেকে 15 পর্যন্ত সংখ্যা প্রিন্ট করতে চাও, কিন্তু 9 বাদে। একটা প্রোগ্রাম লিখ, যেখানে 9 স্কিপ হয়ে যাবে আর বাকি সব সংখ্যা প্রিন্ট হবে।
// Ans:
for (let i = 1; i <= 15; i++) {
  if (i == 9) {
    continue;
  }
  console.log(i);
}

//? Qs:4 :1 থেকে 20 পর্যন্ত সংখ্যা প্রিন্ট কর, কিন্তু 12 বাদে। 12 স্কিপ হয়ে যাবে এবং বাকি সব সংখ্যা প্রিন্ট হবে।
// Ans:
for (let i = 1; i <= 20; i++) {
  if (i == 12) {
    continue;
  }
  console.log(i);
}

//? Qs:5 :1 থেকে 25 পর্যন্ত সংখ্যা প্রিন্ট কর, কিন্তু 3 দিয়ে বিভাজ্য সংখ্যা বাদ যাবে।
// Ans:
for (let i = 1; i <= 25; i++) {
  if (i % 3 == 0) {
    continue;
  }
  console.log(i);
}

//? Qs:6 :91 থেকে 120 পর্যন্ত সংখ্যা প্রিন্ট কর, কিন্তু 10 দিয়ে ভাগ যায়, এমন সংখ্যা পেলে প্রিন্ট করা বন্ধ হয়ে যাবে, থেমে যাবে।
// Ans:
for (let i = 91; i <= 120; i++) {
  if (i % 10 == 0) {
    break;
  }
  console.log(i);
}
